import 'package:shop_app_a_m/model/product.dart';

/// status : true
/// message : null
/// data : {"current_page":1,"data":[{"id":5592,"product":{"id":52,"price":25000,"old_price":25000,"discount":0,"image":"https://student.valuxapps.com/storage/uploads/products/1615440322npwmU.71DVgBTdyLL._SL1500_.jpg","name":"ابل ايفون 12 برو ماكس - 256جيجابيت, ازرق","description":"الحجم: ٦.٧ بوصة\r\nالدقة: 2778 × 1284 بكسل ، 458 نقطة في البوصة\r\nالتكنولوجيا: OLED\r\nالشاشة للجسم: 87.45٪\r\nسطوع الذروة: 1200 شمعة / م 2 (نيت)\r\nالميزات: دعم فيديو HDR ، طلاء مقاوم للزيوت ، زجاج مقاوم للخدش (درع سيراميك) ، مستشعر الإضاءة المحيطة ، مستشعر القرب\r\nالمعدات\r\nشريحة النظام: Apple A14 Bionic\r\nالمعالج: Hexa-core، 64-bit، 5 nm\r\nوحدة معالجة الرسومات: نعم\r\nذاكرة الوصول العشوائي: 6 جيجابايت LPDDR5\r\nالتخزين الداخلي: 128 جيجا بايت (NVMe) ، غير قابلة للتوسيع\r\nنوع الجهاز: هاتف ذكي\r\nنظام التشغيل: iOS (14.x)\r\nالبطارية\r\nالنوع: Li-Ion ، غير قابل للاستبدال بواسطة المستخدم\r\nالشحن: توصيل طاقة USB ، شحن لاسلكي Qi ، شحن لاسلكي MagSafe\r\nسرعة الشحن القصوى: لاسلكي: 15.0 واط\r\nكاميرا\r\nالخلفية: كاميرا ثلاثية\r\nالكاميرا الرئيسية: 12 ميجابكسل (OIS ، PDAF)\r\nالمواصفات: حجم الفتحة: F1.6 ؛ الطول البؤري: 26 مم ؛ حجم البكسل: 1.7 ميكرومتر\r\nكاميرا ثانية: 12 ميجا بيكسل (Telephoto، OIS، PDAF)\r\nالمواصفات: تقريب بصري: 2x؛ حجم الفتحة: F2.2 ؛ الطول البؤري: 65 مم\r\nالكاميرا الثالثة: 12 ميجابكسل (فائقة الاتساع)\r\nالمواصفات: حجم الفتحة: F2.4 ؛ الطول البؤري: 13 ملم\r\nتسجيل الفيديو: 3840 × 2160 (4K UHD) (60 إطارًا في الثانية) ، 1920 × 1080 (Full HD) (240 إطارًا في الثانية) ، 1280 × 720 (HD) (30 إطارًا في الثانية)\r\nالميزات: OIS ، HDR ، فيديو الفاصل الزمني ، ضبط تلقائي للصورة مستمر ، التقاط الصور أثناء تسجيل الفيديو ، إضاءة الفيديو\r\nالأمامية: 12 ميجابكسل (وقت الطيران (ToF) ، EIS ، HDR ، مقاطع فيديو بطيئة الحركة)\r\nالتقاط الفيديو: 3840 × 2160 (4K UHD) (60 إطارًا في الثانية)\r\nالتصميم\r\nالأبعاد: 6.33 × 3.07 × 0.29 بوصة (160.84 × 78.09 × 7.39 ملم)\r\nالوزن: 8.03 أوقية (228.0 جم)\r\nالمواد: الظهر: زجاج ؛ الإطار: ستانلس ستيل\r\nالمواد والألوان: الأزرق الباسيفيكي\r\nالمقاومة: ماء ، رذاذ ، غبار. IP68\r\nالقياسات الحيوية: فتح الوجه ثلاثي الأبعاد\r\nالمفاتيح: اليسار: التحكم في مستوى الصوت ، أخرى ؛ اليمين: مفتاح القفل / فتح القفل\r\nخلوي\r\n5G: n1، n2، n3، n5، n7، n8، n12، n20، n25، n28، n38، n40، n41، n66، n71، n77، n78، n79، n260، n261، Sub-6، mmWave\r\nLTE (FDD): النطاقات 1 (2100) ، 2 (1900) ، 3 (1800) ، 4 (AWS-1) ، 5 (850) ، 7 (2600) ، 8 (900) ، 12 (700 أ) ، 13 (700 ج) ، 14 (700 بس) ، 17 (700 ب) ، 18 (800 أقل) ، 19 (800 علوي) ، 20 (800 دد) ، 25 (1900+) ، 26 (850+) ، 28 (700) APT) ، 29 (700 د) ، 30 (2300 واط) ، 32 (1500 نطاق L) ، 66 (AWS-3) ، 71 (600)\r\nLTE (TDD): النطاقات 34 (2000) ، 38 (2600) ، 39 (1900+) ، 40 (2300) ، 41 (2600+) ، 42 (3500) ، 46 ، 48 (3600)\r\nUMTS: 850 ، 900 ، 1700/2100 ، 1900 ، 2100 ميجا هرتز\r\nسرعة البيانات: LTE-A ، HSDPA + (4G) 42.2 ميجابت / ثانية ، HSUPA 5.76 ميجابت / ثانية ، UMTS\r\nبطاقتي SIM: نعم\r\nنوع بطاقة SIM: Nano SIM ، eSIM\r\nصوت عالي الدقة: نعم\r\nVoLTE: نعم\r\nالوسائط المتعددة\r\nسماعات الرأس: لا يوجد مقبس 3.5 ملم\r\nمكبرات الصوت: سماعة أذن ، مكبر صوت\r\nالميزات: Dolby Atmos\r\nانعكاس الشاشة: مشاركة الشاشة لاسلكيًا\r\nميكروفون (مكبرات) إضافية: لإلغاء الضوضاء\r\nالاتصال والميزات\r\nالبلوتوث: 5.0\r\nشبكة Wi-Fi: 802.11 a ، b ، g ، n ، ac ، ax (Wi-Fi 6) ، ثنائي النطاق ؛ تقنية MIMO و Wi-Fi Direct و Hotspot\r\nUSB: لايتنينج\r\nالميزات: الشحن ، منفذ سماعات الرأس\r\nالموقع: GPS ، A-GPS ، Glonass ، Galileo ، BeiDou ، QZSS ، معرف الخلية ، تحديد المواقع عبر Wi-Fi\r\nالمستشعرات: مقياس تسارع ، جيروسكوب ، بوصلة ، بارومتر ، ماسح ضوئي ليدار\r\nأخرى: NFC ، UMA (اتصال Wi-Fi)\r\nمتوافقة مع المعينات السمعية: M3 ، T4\r\nالماركة: آبل\r\nاللون: أزرق\r\nنوع نظام التشغيل: iOS\r\nسعة التخزين: 128 جيجابايت\r\nعدد مداخل ال SIM: شريحة واحدة و E-SIM\r\nدقة الكاميرا الخلفية: 12 ميجابكسل\r\nنوع الهاتف المحمول: Mobile Phone\r\nتقنية الشبكة الخلوية: 5G\r\nالشركة المصنعة للشرائح: Apple\r\nحجم الشاشة (انش): 6.7 انش\r\nرقم الموديل: iPhone 12 Pro Max\r\nسعة البطارية بالمللي امبير: 3687 مللي امبير\r\nالشحن السريع: نعم\r\nذاكرة الرام: 6 جيجا بايت"}},{"id":5593,"product":{"id":58,"price":1083,"old_price":1083,"discount":0,"image":"https://student.valuxapps.com/storage/uploads/products/161545152160GOl.item_XXL_39275650_152762070.jpeg","name":"أداة تمرين حديد كيتل بيل من ستارك، 24 كجم","description":"العلامة التجارية: ستارك\r\nاللون: اسود\r\nالوزن: 24 كغ\r\nالفئة المستهدفة: للجنسين"}},{"id":5594,"product":{"id":57,"price":530,"old_price":530,"discount":0,"image":"https://student.valuxapps.com/storage/uploads/products/1615451352LMOAF.item_XXL_23705724_34135503.jpeg","name":"هارد اس اس دي داخلي 240 جيجابايت A400 ساتا 3 من كينجستون - 2.5 بوصة - SA400S37/240G","description":"العلامة التجارية : كينغستون\r\nسعة التخزين : 240 جيجابايت\r\nأنظمة التشغيل المتوافقة : ويندوز\r\nنوعية الوصل : ساتا\r\nصنف قرص التخزين : اس اس دي\r\nطبيعة قرص التخرين : داخلي لابتوب"}},{"id":5663,"product":{"id":55,"price":44500,"old_price":44500,"discount":0,"image":"https://student.valuxapps.com/storage/uploads/products/1615442168bVx52.item_XXL_36581132_143760083.jpeg","name":"لاب توب ابل ماك بوك برو","description":"يمكنك التمتع بتجربة الحوسبة بطريقة لم يسبق لها مثيل عندما تقوم باقتناء لاب توب ابل ماك بوك برو. يتميز هذا اللاب توب بمعالج انتل كور i5 من الجيل الثامن بتردد 2.3 جيجاهرتز والذي يضمن لك استمرار أداء النظام بكفاءة عالية. استمتع بتجربة تعدد المهام على نحو سلس وسريع باستخدام ذاكرة الوصول العشوائي بسعة 8 جيجا. يقدم لك معالج الرسومات الجرافيكية انتل ايريس بلس Intel Iris Plus Graphics صور بجودة عالية ويجعل تجربة اللعب الخاصة بك سلسة وممتعة بشكل لم يسبق له مثيل. يوفر نظام التشغيل ماك او اس macOS العديد من الميزات سهلة الاستخدام. قم بتخزين الأفلام المفضلة لديك، والتسجيلات الصوتية، والملفات الهامة الأخرى الخاصة بك بشكل مريح على الذاكرة اس اس دي SSD سعة 512 جيجا. تسمح لك شاشة العرض الرائعة حجم 13.3 انش بعرض الافلام المفضلة لديك والمحتويات الاخرى بجودة عالية. تتميز شاشة ريتينا Retina بإضاءة خلفية ال اي دي زاهية ونسبة تباين عالية تعزز تجربة المشاهدة الخاصة بك. توفر تقنية ترو تون True Tone تجربة مشاهدة طبيعية عن طريق ضبط توازن اللون الأبيض للشاشة حسب درجة حرارة لون الضوء من حولك. يتميز هذا اللاب توب بمخرجات صوتية متوازنة، وعالية الدقة، ونابضة بالحياة، ويوفر لك تجربة صوتية غامرة. تسمح لك شريحة ابل تي Apple T2 بتخزين البيانات الخاصة بك بتنسيق مشفر بمساعدة المعالج الثانوي سيكيور انكليف Secure Enclave. وعلاوة على ذلك، تعمل هذه الشريحة المتطورة على تعزيز وتشديد الحماية والامان لبياناتك بمساعدة من مستشعر التعرف على الهوية عن طريق اللمس Touch ID. يسمح لك هذا المستشعر المتقدم بإلغاء قفل الكمبيوتر المحمول باستخدام بصمات أصابعك فقط. تعمل عناصر التحكم بالشريط اللمسي Touchbar على تبسيط الأنشطة المختلفة مثل إرسال بريد إلكتروني أو تنسيق مستند معين. يمكن حمل لاب توب ابل ماك بوك برو خفيف الوزن بسهولة في حقيبة الظهر الخاصة بك. يتميز هذا اللاب توب باللون الرمادي والذي يضفي عليه مظهراً مميزاً وجميلاً."}}],"first_page_url":"https://student.valuxapps.com/api/favorites?page=1","from":1,"last_page":1,"last_page_url":"https://student.valuxapps.com/api/favorites?page=1","next_page_url":null,"path":"https://student.valuxapps.com/api/favorites","per_page":35,"prev_page_url":null,"to":4,"total":4}

class FavouritesModel {
  bool? _status;
  dynamic _message;
  Data? _data;

  bool? get status => _status;

  dynamic get message => _message;

  Data? get data => _data;

  FavouritesModel({bool? status, dynamic message, Data? data}) {
    _status = status;
    _message = message;
    _data = data;
  }

  FavouritesModel.fromJson(dynamic json) {
    _status = json["status"];
    _message = json["message"];
    _data = json["data"] != null ? Data.fromJson(json["data"]) : null;
  }

  Map<String, dynamic> toJson() {
    var map = <String, dynamic>{};
    map["status"] = _status;
    map["message"] = _message;
    if (_data != null) {
      map["data"] = _data?.toJson();
    }
    return map;
  }
}

/// current_page : 1
/// data : [{"id":5592,"product":{"id":52,"price":25000,"old_price":25000,"discount":0,"image":"https://student.valuxapps.com/storage/uploads/products/1615440322npwmU.71DVgBTdyLL._SL1500_.jpg","name":"ابل ايفون 12 برو ماكس - 256جيجابيت, ازرق","description":"الحجم: ٦.٧ بوصة\r\nالدقة: 2778 × 1284 بكسل ، 458 نقطة في البوصة\r\nالتكنولوجيا: OLED\r\nالشاشة للجسم: 87.45٪\r\nسطوع الذروة: 1200 شمعة / م 2 (نيت)\r\nالميزات: دعم فيديو HDR ، طلاء مقاوم للزيوت ، زجاج مقاوم للخدش (درع سيراميك) ، مستشعر الإضاءة المحيطة ، مستشعر القرب\r\nالمعدات\r\nشريحة النظام: Apple A14 Bionic\r\nالمعالج: Hexa-core، 64-bit، 5 nm\r\nوحدة معالجة الرسومات: نعم\r\nذاكرة الوصول العشوائي: 6 جيجابايت LPDDR5\r\nالتخزين الداخلي: 128 جيجا بايت (NVMe) ، غير قابلة للتوسيع\r\nنوع الجهاز: هاتف ذكي\r\nنظام التشغيل: iOS (14.x)\r\nالبطارية\r\nالنوع: Li-Ion ، غير قابل للاستبدال بواسطة المستخدم\r\nالشحن: توصيل طاقة USB ، شحن لاسلكي Qi ، شحن لاسلكي MagSafe\r\nسرعة الشحن القصوى: لاسلكي: 15.0 واط\r\nكاميرا\r\nالخلفية: كاميرا ثلاثية\r\nالكاميرا الرئيسية: 12 ميجابكسل (OIS ، PDAF)\r\nالمواصفات: حجم الفتحة: F1.6 ؛ الطول البؤري: 26 مم ؛ حجم البكسل: 1.7 ميكرومتر\r\nكاميرا ثانية: 12 ميجا بيكسل (Telephoto، OIS، PDAF)\r\nالمواصفات: تقريب بصري: 2x؛ حجم الفتحة: F2.2 ؛ الطول البؤري: 65 مم\r\nالكاميرا الثالثة: 12 ميجابكسل (فائقة الاتساع)\r\nالمواصفات: حجم الفتحة: F2.4 ؛ الطول البؤري: 13 ملم\r\nتسجيل الفيديو: 3840 × 2160 (4K UHD) (60 إطارًا في الثانية) ، 1920 × 1080 (Full HD) (240 إطارًا في الثانية) ، 1280 × 720 (HD) (30 إطارًا في الثانية)\r\nالميزات: OIS ، HDR ، فيديو الفاصل الزمني ، ضبط تلقائي للصورة مستمر ، التقاط الصور أثناء تسجيل الفيديو ، إضاءة الفيديو\r\nالأمامية: 12 ميجابكسل (وقت الطيران (ToF) ، EIS ، HDR ، مقاطع فيديو بطيئة الحركة)\r\nالتقاط الفيديو: 3840 × 2160 (4K UHD) (60 إطارًا في الثانية)\r\nالتصميم\r\nالأبعاد: 6.33 × 3.07 × 0.29 بوصة (160.84 × 78.09 × 7.39 ملم)\r\nالوزن: 8.03 أوقية (228.0 جم)\r\nالمواد: الظهر: زجاج ؛ الإطار: ستانلس ستيل\r\nالمواد والألوان: الأزرق الباسيفيكي\r\nالمقاومة: ماء ، رذاذ ، غبار. IP68\r\nالقياسات الحيوية: فتح الوجه ثلاثي الأبعاد\r\nالمفاتيح: اليسار: التحكم في مستوى الصوت ، أخرى ؛ اليمين: مفتاح القفل / فتح القفل\r\nخلوي\r\n5G: n1، n2، n3، n5، n7، n8، n12، n20، n25، n28، n38، n40، n41، n66، n71، n77، n78، n79، n260، n261، Sub-6، mmWave\r\nLTE (FDD): النطاقات 1 (2100) ، 2 (1900) ، 3 (1800) ، 4 (AWS-1) ، 5 (850) ، 7 (2600) ، 8 (900) ، 12 (700 أ) ، 13 (700 ج) ، 14 (700 بس) ، 17 (700 ب) ، 18 (800 أقل) ، 19 (800 علوي) ، 20 (800 دد) ، 25 (1900+) ، 26 (850+) ، 28 (700) APT) ، 29 (700 د) ، 30 (2300 واط) ، 32 (1500 نطاق L) ، 66 (AWS-3) ، 71 (600)\r\nLTE (TDD): النطاقات 34 (2000) ، 38 (2600) ، 39 (1900+) ، 40 (2300) ، 41 (2600+) ، 42 (3500) ، 46 ، 48 (3600)\r\nUMTS: 850 ، 900 ، 1700/2100 ، 1900 ، 2100 ميجا هرتز\r\nسرعة البيانات: LTE-A ، HSDPA + (4G) 42.2 ميجابت / ثانية ، HSUPA 5.76 ميجابت / ثانية ، UMTS\r\nبطاقتي SIM: نعم\r\nنوع بطاقة SIM: Nano SIM ، eSIM\r\nصوت عالي الدقة: نعم\r\nVoLTE: نعم\r\nالوسائط المتعددة\r\nسماعات الرأس: لا يوجد مقبس 3.5 ملم\r\nمكبرات الصوت: سماعة أذن ، مكبر صوت\r\nالميزات: Dolby Atmos\r\nانعكاس الشاشة: مشاركة الشاشة لاسلكيًا\r\nميكروفون (مكبرات) إضافية: لإلغاء الضوضاء\r\nالاتصال والميزات\r\nالبلوتوث: 5.0\r\nشبكة Wi-Fi: 802.11 a ، b ، g ، n ، ac ، ax (Wi-Fi 6) ، ثنائي النطاق ؛ تقنية MIMO و Wi-Fi Direct و Hotspot\r\nUSB: لايتنينج\r\nالميزات: الشحن ، منفذ سماعات الرأس\r\nالموقع: GPS ، A-GPS ، Glonass ، Galileo ، BeiDou ، QZSS ، معرف الخلية ، تحديد المواقع عبر Wi-Fi\r\nالمستشعرات: مقياس تسارع ، جيروسكوب ، بوصلة ، بارومتر ، ماسح ضوئي ليدار\r\nأخرى: NFC ، UMA (اتصال Wi-Fi)\r\nمتوافقة مع المعينات السمعية: M3 ، T4\r\nالماركة: آبل\r\nاللون: أزرق\r\nنوع نظام التشغيل: iOS\r\nسعة التخزين: 128 جيجابايت\r\nعدد مداخل ال SIM: شريحة واحدة و E-SIM\r\nدقة الكاميرا الخلفية: 12 ميجابكسل\r\nنوع الهاتف المحمول: Mobile Phone\r\nتقنية الشبكة الخلوية: 5G\r\nالشركة المصنعة للشرائح: Apple\r\nحجم الشاشة (انش): 6.7 انش\r\nرقم الموديل: iPhone 12 Pro Max\r\nسعة البطارية بالمللي امبير: 3687 مللي امبير\r\nالشحن السريع: نعم\r\nذاكرة الرام: 6 جيجا بايت"}},{"id":5593,"product":{"id":58,"price":1083,"old_price":1083,"discount":0,"image":"https://student.valuxapps.com/storage/uploads/products/161545152160GOl.item_XXL_39275650_152762070.jpeg","name":"أداة تمرين حديد كيتل بيل من ستارك، 24 كجم","description":"العلامة التجارية: ستارك\r\nاللون: اسود\r\nالوزن: 24 كغ\r\nالفئة المستهدفة: للجنسين"}},{"id":5594,"product":{"id":57,"price":530,"old_price":530,"discount":0,"image":"https://student.valuxapps.com/storage/uploads/products/1615451352LMOAF.item_XXL_23705724_34135503.jpeg","name":"هارد اس اس دي داخلي 240 جيجابايت A400 ساتا 3 من كينجستون - 2.5 بوصة - SA400S37/240G","description":"العلامة التجارية : كينغستون\r\nسعة التخزين : 240 جيجابايت\r\nأنظمة التشغيل المتوافقة : ويندوز\r\nنوعية الوصل : ساتا\r\nصنف قرص التخزين : اس اس دي\r\nطبيعة قرص التخرين : داخلي لابتوب"}},{"id":5663,"product":{"id":55,"price":44500,"old_price":44500,"discount":0,"image":"https://student.valuxapps.com/storage/uploads/products/1615442168bVx52.item_XXL_36581132_143760083.jpeg","name":"لاب توب ابل ماك بوك برو","description":"يمكنك التمتع بتجربة الحوسبة بطريقة لم يسبق لها مثيل عندما تقوم باقتناء لاب توب ابل ماك بوك برو. يتميز هذا اللاب توب بمعالج انتل كور i5 من الجيل الثامن بتردد 2.3 جيجاهرتز والذي يضمن لك استمرار أداء النظام بكفاءة عالية. استمتع بتجربة تعدد المهام على نحو سلس وسريع باستخدام ذاكرة الوصول العشوائي بسعة 8 جيجا. يقدم لك معالج الرسومات الجرافيكية انتل ايريس بلس Intel Iris Plus Graphics صور بجودة عالية ويجعل تجربة اللعب الخاصة بك سلسة وممتعة بشكل لم يسبق له مثيل. يوفر نظام التشغيل ماك او اس macOS العديد من الميزات سهلة الاستخدام. قم بتخزين الأفلام المفضلة لديك، والتسجيلات الصوتية، والملفات الهامة الأخرى الخاصة بك بشكل مريح على الذاكرة اس اس دي SSD سعة 512 جيجا. تسمح لك شاشة العرض الرائعة حجم 13.3 انش بعرض الافلام المفضلة لديك والمحتويات الاخرى بجودة عالية. تتميز شاشة ريتينا Retina بإضاءة خلفية ال اي دي زاهية ونسبة تباين عالية تعزز تجربة المشاهدة الخاصة بك. توفر تقنية ترو تون True Tone تجربة مشاهدة طبيعية عن طريق ضبط توازن اللون الأبيض للشاشة حسب درجة حرارة لون الضوء من حولك. يتميز هذا اللاب توب بمخرجات صوتية متوازنة، وعالية الدقة، ونابضة بالحياة، ويوفر لك تجربة صوتية غامرة. تسمح لك شريحة ابل تي Apple T2 بتخزين البيانات الخاصة بك بتنسيق مشفر بمساعدة المعالج الثانوي سيكيور انكليف Secure Enclave. وعلاوة على ذلك، تعمل هذه الشريحة المتطورة على تعزيز وتشديد الحماية والامان لبياناتك بمساعدة من مستشعر التعرف على الهوية عن طريق اللمس Touch ID. يسمح لك هذا المستشعر المتقدم بإلغاء قفل الكمبيوتر المحمول باستخدام بصمات أصابعك فقط. تعمل عناصر التحكم بالشريط اللمسي Touchbar على تبسيط الأنشطة المختلفة مثل إرسال بريد إلكتروني أو تنسيق مستند معين. يمكن حمل لاب توب ابل ماك بوك برو خفيف الوزن بسهولة في حقيبة الظهر الخاصة بك. يتميز هذا اللاب توب باللون الرمادي والذي يضفي عليه مظهراً مميزاً وجميلاً."}}]
/// first_page_url : "https://student.valuxapps.com/api/favorites?page=1"
/// from : 1
/// last_page : 1
/// last_page_url : "https://student.valuxapps.com/api/favorites?page=1"
/// next_page_url : null
/// path : "https://student.valuxapps.com/api/favorites"
/// per_page : 35
/// prev_page_url : null
/// to : 4
/// total : 4

class Data {
  int? _currentPage;
  List<DataInSideFavorites>? _dataInSideFavorites;
  String? _firstPageUrl;
  int? _from;
  int? _lastPage;
  String? _lastPageUrl;
  dynamic _nextPageUrl;
  String? _path;
  int? _perPage;
  dynamic _prevPageUrl;
  int? _to;
  int? _total;

  int? get currentPage => _currentPage;

  List<DataInSideFavorites>? get dataInSideFavorites => _dataInSideFavorites;

  String? get firstPageUrl => _firstPageUrl;

  int? get from => _from;

  int? get lastPage => _lastPage;

  String? get lastPageUrl => _lastPageUrl;

  dynamic get nextPageUrl => _nextPageUrl;

  String? get path => _path;

  int? get perPage => _perPage;

  dynamic get prevPageUrl => _prevPageUrl;

  int? get to => _to;

  int? get total => _total;

  Data(
      {int? currentPage,
      List<DataInSideFavorites>? dataInSideFavorites,
      String? firstPageUrl,
      int? from,
      int? lastPage,
      String? lastPageUrl,
      dynamic nextPageUrl,
      String? path,
      int? perPage,
      dynamic prevPageUrl,
      int? to,
      int? total}) {
    _currentPage = currentPage;
    _dataInSideFavorites = dataInSideFavorites;
    _firstPageUrl = firstPageUrl;
    _from = from;
    _lastPage = lastPage;
    _lastPageUrl = lastPageUrl;
    _nextPageUrl = nextPageUrl;
    _path = path;
    _perPage = perPage;
    _prevPageUrl = prevPageUrl;
    _to = to;
    _total = total;
  }

  Data.fromJson(dynamic json) {
    _currentPage = json["current_page"];
    if (json["data"] != null) {
      _dataInSideFavorites = [];
      json["data"].forEach((v) {
        _dataInSideFavorites?.add(DataInSideFavorites.fromJson(v));
      });
    }
    _firstPageUrl = json["first_page_url"];
    _from = json["from"];
    _lastPage = json["last_page"];
    _lastPageUrl = json["last_page_url"];
    _nextPageUrl = json["next_page_url"];
    _path = json["path"];
    _perPage = json["per_page"];
    _prevPageUrl = json["prev_page_url"];
    _to = json["to"];
    _total = json["total"];
  }

  Map<String, dynamic> toJson() {
    var map = <String, dynamic>{};
    map["current_page"] = _currentPage;
    if (_dataInSideFavorites != null) {
      map["data"] = _dataInSideFavorites?.map((v) => v.toJson()).toList();
    }
    map["first_page_url"] = _firstPageUrl;
    map["from"] = _from;
    map["last_page"] = _lastPage;
    map["last_page_url"] = _lastPageUrl;
    map["next_page_url"] = _nextPageUrl;
    map["path"] = _path;
    map["per_page"] = _perPage;
    map["prev_page_url"] = _prevPageUrl;
    map["to"] = _to;
    map["total"] = _total;
    return map;
  }
}

/// id : 5592
/// product : {"id":52,"price":25000,"old_price":25000,"discount":0,"image":"https://student.valuxapps.com/storage/uploads/products/1615440322npwmU.71DVgBTdyLL._SL1500_.jpg","name":"ابل ايفون 12 برو ماكس - 256جيجابيت, ازرق","description":"الحجم: ٦.٧ بوصة\r\nالدقة: 2778 × 1284 بكسل ، 458 نقطة في البوصة\r\nالتكنولوجيا: OLED\r\nالشاشة للجسم: 87.45٪\r\nسطوع الذروة: 1200 شمعة / م 2 (نيت)\r\nالميزات: دعم فيديو HDR ، طلاء مقاوم للزيوت ، زجاج مقاوم للخدش (درع سيراميك) ، مستشعر الإضاءة المحيطة ، مستشعر القرب\r\nالمعدات\r\nشريحة النظام: Apple A14 Bionic\r\nالمعالج: Hexa-core، 64-bit، 5 nm\r\nوحدة معالجة الرسومات: نعم\r\nذاكرة الوصول العشوائي: 6 جيجابايت LPDDR5\r\nالتخزين الداخلي: 128 جيجا بايت (NVMe) ، غير قابلة للتوسيع\r\nنوع الجهاز: هاتف ذكي\r\nنظام التشغيل: iOS (14.x)\r\nالبطارية\r\nالنوع: Li-Ion ، غير قابل للاستبدال بواسطة المستخدم\r\nالشحن: توصيل طاقة USB ، شحن لاسلكي Qi ، شحن لاسلكي MagSafe\r\nسرعة الشحن القصوى: لاسلكي: 15.0 واط\r\nكاميرا\r\nالخلفية: كاميرا ثلاثية\r\nالكاميرا الرئيسية: 12 ميجابكسل (OIS ، PDAF)\r\nالمواصفات: حجم الفتحة: F1.6 ؛ الطول البؤري: 26 مم ؛ حجم البكسل: 1.7 ميكرومتر\r\nكاميرا ثانية: 12 ميجا بيكسل (Telephoto، OIS، PDAF)\r\nالمواصفات: تقريب بصري: 2x؛ حجم الفتحة: F2.2 ؛ الطول البؤري: 65 مم\r\nالكاميرا الثالثة: 12 ميجابكسل (فائقة الاتساع)\r\nالمواصفات: حجم الفتحة: F2.4 ؛ الطول البؤري: 13 ملم\r\nتسجيل الفيديو: 3840 × 2160 (4K UHD) (60 إطارًا في الثانية) ، 1920 × 1080 (Full HD) (240 إطارًا في الثانية) ، 1280 × 720 (HD) (30 إطارًا في الثانية)\r\nالميزات: OIS ، HDR ، فيديو الفاصل الزمني ، ضبط تلقائي للصورة مستمر ، التقاط الصور أثناء تسجيل الفيديو ، إضاءة الفيديو\r\nالأمامية: 12 ميجابكسل (وقت الطيران (ToF) ، EIS ، HDR ، مقاطع فيديو بطيئة الحركة)\r\nالتقاط الفيديو: 3840 × 2160 (4K UHD) (60 إطارًا في الثانية)\r\nالتصميم\r\nالأبعاد: 6.33 × 3.07 × 0.29 بوصة (160.84 × 78.09 × 7.39 ملم)\r\nالوزن: 8.03 أوقية (228.0 جم)\r\nالمواد: الظهر: زجاج ؛ الإطار: ستانلس ستيل\r\nالمواد والألوان: الأزرق الباسيفيكي\r\nالمقاومة: ماء ، رذاذ ، غبار. IP68\r\nالقياسات الحيوية: فتح الوجه ثلاثي الأبعاد\r\nالمفاتيح: اليسار: التحكم في مستوى الصوت ، أخرى ؛ اليمين: مفتاح القفل / فتح القفل\r\nخلوي\r\n5G: n1، n2، n3، n5، n7، n8، n12، n20، n25، n28، n38، n40، n41، n66، n71، n77، n78، n79، n260، n261، Sub-6، mmWave\r\nLTE (FDD): النطاقات 1 (2100) ، 2 (1900) ، 3 (1800) ، 4 (AWS-1) ، 5 (850) ، 7 (2600) ، 8 (900) ، 12 (700 أ) ، 13 (700 ج) ، 14 (700 بس) ، 17 (700 ب) ، 18 (800 أقل) ، 19 (800 علوي) ، 20 (800 دد) ، 25 (1900+) ، 26 (850+) ، 28 (700) APT) ، 29 (700 د) ، 30 (2300 واط) ، 32 (1500 نطاق L) ، 66 (AWS-3) ، 71 (600)\r\nLTE (TDD): النطاقات 34 (2000) ، 38 (2600) ، 39 (1900+) ، 40 (2300) ، 41 (2600+) ، 42 (3500) ، 46 ، 48 (3600)\r\nUMTS: 850 ، 900 ، 1700/2100 ، 1900 ، 2100 ميجا هرتز\r\nسرعة البيانات: LTE-A ، HSDPA + (4G) 42.2 ميجابت / ثانية ، HSUPA 5.76 ميجابت / ثانية ، UMTS\r\nبطاقتي SIM: نعم\r\nنوع بطاقة SIM: Nano SIM ، eSIM\r\nصوت عالي الدقة: نعم\r\nVoLTE: نعم\r\nالوسائط المتعددة\r\nسماعات الرأس: لا يوجد مقبس 3.5 ملم\r\nمكبرات الصوت: سماعة أذن ، مكبر صوت\r\nالميزات: Dolby Atmos\r\nانعكاس الشاشة: مشاركة الشاشة لاسلكيًا\r\nميكروفون (مكبرات) إضافية: لإلغاء الضوضاء\r\nالاتصال والميزات\r\nالبلوتوث: 5.0\r\nشبكة Wi-Fi: 802.11 a ، b ، g ، n ، ac ، ax (Wi-Fi 6) ، ثنائي النطاق ؛ تقنية MIMO و Wi-Fi Direct و Hotspot\r\nUSB: لايتنينج\r\nالميزات: الشحن ، منفذ سماعات الرأس\r\nالموقع: GPS ، A-GPS ، Glonass ، Galileo ، BeiDou ، QZSS ، معرف الخلية ، تحديد المواقع عبر Wi-Fi\r\nالمستشعرات: مقياس تسارع ، جيروسكوب ، بوصلة ، بارومتر ، ماسح ضوئي ليدار\r\nأخرى: NFC ، UMA (اتصال Wi-Fi)\r\nمتوافقة مع المعينات السمعية: M3 ، T4\r\nالماركة: آبل\r\nاللون: أزرق\r\nنوع نظام التشغيل: iOS\r\nسعة التخزين: 128 جيجابايت\r\nعدد مداخل ال SIM: شريحة واحدة و E-SIM\r\nدقة الكاميرا الخلفية: 12 ميجابكسل\r\nنوع الهاتف المحمول: Mobile Phone\r\nتقنية الشبكة الخلوية: 5G\r\nالشركة المصنعة للشرائح: Apple\r\nحجم الشاشة (انش): 6.7 انش\r\nرقم الموديل: iPhone 12 Pro Max\r\nسعة البطارية بالمللي امبير: 3687 مللي امبير\r\nالشحن السريع: نعم\r\nذاكرة الرام: 6 جيجا بايت"}

class DataInSideFavorites {
  int? _id;
  Product? _product;

  int? get id => _id;

  Product? get product => _product;

  DataInSideFavorites({int? id, Product? product}) {
    _id = id;
    _product = product;
  }

  DataInSideFavorites.fromJson(dynamic json) {
    _id = json["id"];
    _product =
        json["product"] != null ? Product.fromJson(json["product"]) : null;
  }

  Map<String, dynamic> toJson() {
    var map = <String, dynamic>{};
    map["id"] = _id;
    if (_product != null) {
      map["product"] = _product?.toJson();
    }
    return map;
  }
}

/// id : 52
/// price : 25000
/// old_price : 25000
/// discount : 0
/// image : "https://student.valuxapps.com/storage/uploads/products/1615440322npwmU.71DVgBTdyLL._SL1500_.jpg"
/// name : "ابل ايفون 12 برو ماكس - 256جيجابيت, ازرق"
/// description : "الحجم: ٦.٧ بوصة\r\nالدقة: 2778 × 1284 بكسل ، 458 نقطة في البوصة\r\nالتكنولوجيا: OLED\r\nالشاشة للجسم: 87.45٪\r\nسطوع الذروة: 1200 شمعة / م 2 (نيت)\r\nالميزات: دعم فيديو HDR ، طلاء مقاوم للزيوت ، زجاج مقاوم للخدش (درع سيراميك) ، مستشعر الإضاءة المحيطة ، مستشعر القرب\r\nالمعدات\r\nشريحة النظام: Apple A14 Bionic\r\nالمعالج: Hexa-core، 64-bit، 5 nm\r\nوحدة معالجة الرسومات: نعم\r\nذاكرة الوصول العشوائي: 6 جيجابايت LPDDR5\r\nالتخزين الداخلي: 128 جيجا بايت (NVMe) ، غير قابلة للتوسيع\r\nنوع الجهاز: هاتف ذكي\r\nنظام التشغيل: iOS (14.x)\r\nالبطارية\r\nالنوع: Li-Ion ، غير قابل للاستبدال بواسطة المستخدم\r\nالشحن: توصيل طاقة USB ، شحن لاسلكي Qi ، شحن لاسلكي MagSafe\r\nسرعة الشحن القصوى: لاسلكي: 15.0 واط\r\nكاميرا\r\nالخلفية: كاميرا ثلاثية\r\nالكاميرا الرئيسية: 12 ميجابكسل (OIS ، PDAF)\r\nالمواصفات: حجم الفتحة: F1.6 ؛ الطول البؤري: 26 مم ؛ حجم البكسل: 1.7 ميكرومتر\r\nكاميرا ثانية: 12 ميجا بيكسل (Telephoto، OIS، PDAF)\r\nالمواصفات: تقريب بصري: 2x؛ حجم الفتحة: F2.2 ؛ الطول البؤري: 65 مم\r\nالكاميرا الثالثة: 12 ميجابكسل (فائقة الاتساع)\r\nالمواصفات: حجم الفتحة: F2.4 ؛ الطول البؤري: 13 ملم\r\nتسجيل الفيديو: 3840 × 2160 (4K UHD) (60 إطارًا في الثانية) ، 1920 × 1080 (Full HD) (240 إطارًا في الثانية) ، 1280 × 720 (HD) (30 إطارًا في الثانية)\r\nالميزات: OIS ، HDR ، فيديو الفاصل الزمني ، ضبط تلقائي للصورة مستمر ، التقاط الصور أثناء تسجيل الفيديو ، إضاءة الفيديو\r\nالأمامية: 12 ميجابكسل (وقت الطيران (ToF) ، EIS ، HDR ، مقاطع فيديو بطيئة الحركة)\r\nالتقاط الفيديو: 3840 × 2160 (4K UHD) (60 إطارًا في الثانية)\r\nالتصميم\r\nالأبعاد: 6.33 × 3.07 × 0.29 بوصة (160.84 × 78.09 × 7.39 ملم)\r\nالوزن: 8.03 أوقية (228.0 جم)\r\nالمواد: الظهر: زجاج ؛ الإطار: ستانلس ستيل\r\nالمواد والألوان: الأزرق الباسيفيكي\r\nالمقاومة: ماء ، رذاذ ، غبار. IP68\r\nالقياسات الحيوية: فتح الوجه ثلاثي الأبعاد\r\nالمفاتيح: اليسار: التحكم في مستوى الصوت ، أخرى ؛ اليمين: مفتاح القفل / فتح القفل\r\nخلوي\r\n5G: n1، n2، n3، n5، n7، n8، n12، n20، n25، n28، n38، n40، n41، n66، n71، n77، n78، n79، n260، n261، Sub-6، mmWave\r\nLTE (FDD): النطاقات 1 (2100) ، 2 (1900) ، 3 (1800) ، 4 (AWS-1) ، 5 (850) ، 7 (2600) ، 8 (900) ، 12 (700 أ) ، 13 (700 ج) ، 14 (700 بس) ، 17 (700 ب) ، 18 (800 أقل) ، 19 (800 علوي) ، 20 (800 دد) ، 25 (1900+) ، 26 (850+) ، 28 (700) APT) ، 29 (700 د) ، 30 (2300 واط) ، 32 (1500 نطاق L) ، 66 (AWS-3) ، 71 (600)\r\nLTE (TDD): النطاقات 34 (2000) ، 38 (2600) ، 39 (1900+) ، 40 (2300) ، 41 (2600+) ، 42 (3500) ، 46 ، 48 (3600)\r\nUMTS: 850 ، 900 ، 1700/2100 ، 1900 ، 2100 ميجا هرتز\r\nسرعة البيانات: LTE-A ، HSDPA + (4G) 42.2 ميجابت / ثانية ، HSUPA 5.76 ميجابت / ثانية ، UMTS\r\nبطاقتي SIM: نعم\r\nنوع بطاقة SIM: Nano SIM ، eSIM\r\nصوت عالي الدقة: نعم\r\nVoLTE: نعم\r\nالوسائط المتعددة\r\nسماعات الرأس: لا يوجد مقبس 3.5 ملم\r\nمكبرات الصوت: سماعة أذن ، مكبر صوت\r\nالميزات: Dolby Atmos\r\nانعكاس الشاشة: مشاركة الشاشة لاسلكيًا\r\nميكروفون (مكبرات) إضافية: لإلغاء الضوضاء\r\nالاتصال والميزات\r\nالبلوتوث: 5.0\r\nشبكة Wi-Fi: 802.11 a ، b ، g ، n ، ac ، ax (Wi-Fi 6) ، ثنائي النطاق ؛ تقنية MIMO و Wi-Fi Direct و Hotspot\r\nUSB: لايتنينج\r\nالميزات: الشحن ، منفذ سماعات الرأس\r\nالموقع: GPS ، A-GPS ، Glonass ، Galileo ، BeiDou ، QZSS ، معرف الخلية ، تحديد المواقع عبر Wi-Fi\r\nالمستشعرات: مقياس تسارع ، جيروسكوب ، بوصلة ، بارومتر ، ماسح ضوئي ليدار\r\nأخرى: NFC ، UMA (اتصال Wi-Fi)\r\nمتوافقة مع المعينات السمعية: M3 ، T4\r\nالماركة: آبل\r\nاللون: أزرق\r\nنوع نظام التشغيل: iOS\r\nسعة التخزين: 128 جيجابايت\r\nعدد مداخل ال SIM: شريحة واحدة و E-SIM\r\nدقة الكاميرا الخلفية: 12 ميجابكسل\r\nنوع الهاتف المحمول: Mobile Phone\r\nتقنية الشبكة الخلوية: 5G\r\nالشركة المصنعة للشرائح: Apple\r\nحجم الشاشة (انش): 6.7 انش\r\nرقم الموديل: iPhone 12 Pro Max\r\nسعة البطارية بالمللي امبير: 3687 مللي امبير\r\nالشحن السريع: نعم\r\nذاكرة الرام: 6 جيجا بايت"
